"""
NxN 개의 수가 NxN 크기의 표에 채워져있다.
표 안의 수 중
(X1, Y1)에서  (X2, Y2) 까지의 합을 구하려 한다.
X는 행, Y는 열을 의미한다.
예를 들어 N=4 이고, 표가 아래와 같이 채워져 있을 때를 살펴보자.
1 2 3 4
2 3 4 5
3 4 5 6
4 5 6 7
(2,2) 에서 (3,4) 까지의 합을 구하면 3+4+5+4+5+6 이고
(4,4) 에서 (4,4) 까지의 합을 구하면 7이다
표에 채워져 있는 수의 합을 구하는 연산이 주어졌을 때, 이를 처리하는 프로그램을 작성하라.
"""
# 1번째 줄에 표의 크기 N과 합을 구해야하는 횟수 M이 주어진다.
# 1 <= N <= 1024, 1<= M <=100,000
# 2번째 줄부터 N개의 줄에는 표에 채워져 있는 수가 1행부터 차례대로 주어진다.
# 다음 M 개의 줄에는 X1, Y1, X2, Y2 가 주어지며 (X1,Y1) 에서 (X2, Y2) 의 합을 구해 출력해야한다.
# 표에 채워져 있는 수는 1,000 보다 작거나 같은 자연수다(X1<=X2, Y1<=Y2)


정말 지루하다
